app/views/users/show.html.erb

			<p><strong>Avatar:</strong></p>
			<% if @user.user_image.exists? %>
---
SELECT  1 AS one FROM "images" WHERE "images"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "images".* FROM "images" WHERE "images"."user_id" = ?  [["user_id", 6]]