app/views/posts/index.html.erb

								<p><%= post.content %></p>
								<% if post.images.present? %>
---
SELECT "images".* FROM "images" WHERE "images"."post_id" = ?  [["post_id", 1]]