app/controllers/posts_controller.rb

	def index
		@posts = Post.all.order(:created_at).reverse
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" ASC

	def create
		@post = current_user.posts.new(content: params[:post][:content])
		if @post.save
			#ExampleMailer.sample_email(@user).deliver
			if params[:images].present?
				params[:images].each do |image|
					@post.images.create(img: image)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello first post"], ["user_id", 1], ["created_at", "2017-07-05 04:55:14.632561"], ["updated_at", "2017-07-05 04:55:14.632561"]]
INSERT INTO "images" ("post_id", "created_at", "updated_at", "img_file_name", "img_content_type", "img_file_size", "img_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def destroy
		#puts "PARAM ID: " + params[:id]
		if current_user()
			post = current_user.posts.find_by(id: params[:id])
			if post
				flash[:notice] = "delete successfully"
				post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]