app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)

		if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Kaier"], ["last_name", "Po"], ["email", "p@gmail.com"], ["password", "123456"], ["created_at", "2017-07-05 04:29:46.768665"], ["updated_at", "2017-07-05 04:29:46.768665"]]

	def update

		@user = current_user
		if @user

			if params[:images].present?
				params[:images].each do |image|
					@user.images.create(img: image, post_id: Post.last.id)
---
INSERT INTO "images" ("post_id", "created_at", "updated_at", "img_file_name", "img_content_type", "img_file_size", "img_updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]